import random
rnd1 = random.randint(2,999)              # Загадаем случайное число
rnd2 = random.randint(2,999)              # Загадаем еще одно число
sum = rnd1+rnd2                           # Строим квадратное уравнение
prod = rnd1*rnd2                          # Дискриминант уравнения D=S^2-4*P
res1=(sum-(sum**2-4*prod)**0.5)/2         # Находим корни по формуле (S+/-sqrD)/2  
res2=(sum+(sum**2-4*prod)**0.5)/2
res1=int(res1)                       
res2=int(res2)
print ("Петя говорит - \"Катя, отгадай два числа, сумма равна",sum,"а произведение",prod,"?!")
print ("Катя задумалась и отвечает - \"Эти числа -",res1,"и",res2,"!")